import MainTableItem from './MainTableItem';
import MainTableName from './MainTableName';

const MainStock = () => {
    const keys = [
        '종목명',
        '현재가',
        '전일비',
        '등락률',
        '매수호가',
        '매도호가',
        '매수총잔량',
        '매도총잔량',
    ];
    const values = [
        ['카카오', 9880, 1870, '23.35%', 7507, 8702, 44, 0],
        ['다음', 14200, 7870, '23.35%', 4567, 7850, 44, 0],
        ['네이버', 14200, 7870, '23.35%', 4567, 7850, 44, 0],
        ['삼성전자', 14200, 7870, '23.35%', 4567, 7850, 44, 0],
        ['현대중공업', 14200, 7870, '23.35%', 4567, 7850, 44, 0],
        ['(주) SK이노베이션', 14200, 7870, '23.35%', 4567, 7850, 44, 0],
        ['빽다방', 14200, 7870, '23.35%', 4567, 7850, 44, 0],
        ['현대중공업', 14200, 7870, '23.35%', 4567, 7850, 44, 0],
        ['(주) SK이노베이션', 14200, 7870, '23.35%', 4567, 7850, 44, 0],
        ['빽다방', 14200, 7870, '23.35%', 4567, 7850, 44, 0],
    ];

    return (
        <div>
            <MainTableName keys={keys} />
            <MainTableItem values={values} />
        </div>
    );
};

export default MainStock;
